### Import the library pandas as pd

#### Import արեք pandas գրադարանը pd  անունով

In [118]:
import numpy as np
import pandas as pd
import datetime

### Import the dataset gender.txt, assign to a variable gender

### Import արեք gender.txt dataset-ը, վերագրեք այն gender փոփոխականին

In [119]:
gender = pd.read_csv ('gender.txt', sep = '|')

### Check the datatypes in the dataframe

### Ստուգեք աղյուսակի սյուների տիպերը

In [120]:
gender.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Convert the datatype of the column 'occupation' into categorical

### Վերածեք 'occupation' սյունը categorical տիպի

In [121]:
gender.occupation = gender.occupation.astype('category')

### Replace the values in the column 'gender' with Male and Female accordingly. Do this with 2 methods: using apply and map.

### Փոխարինեք  'gender' սյան արժեքները Male և Female արժեքներով, արեք սա երկու տարբերակով՝ գործածելով apply և map ֆունկցիաները

In [122]:
# 1
gender.gender = gender.gender.apply(lambda g: 'Male' if g == 'M' else 'Female')

# 2
# gender.gender = gender.gender.map({'M': 'Male', 'F': 'Female'})

### Calculate the mean, median and std of age values for each occupation

### Հաշվեք age սյան mean, median և std արժեքները occupation սյան ամեն արժեքի համար

In [123]:
print(np.mean(gender.age))
print(np.median(gender.age))
print(np.std(gender.age))

34.05196182396607
31.0
12.18627315093722

### Create a new column 'birth_year' and get the birth year of each individual using the values from the column 'age'

### Ստեղծեք 'birth_year' անունով նոր սյուն, որում կպահեք ամեն մարդու ծննդյան տարին, որը կստանաք օգտագործելով 'birth_year' սյան արժեքները

In [124]:
gender['birth_year'] = 2021 - gender.age

### Create a new column 'birth_date' using the column 'birth_year' and current month and day values"

### Ստեղծեք 'birth_date' անունով նոր սյուն, որի արժեքները կստանաք գործածելով 'birth_year' սյան արժեքները ինչպես նաև այս պահի ամիսն ու օրը։

In [125]:
now = datetime.datetime.now()
gender['birth_date'] = gender.birth_year.map(lambda year: datetime.datetime(year, now.month, now.day))
gender.birth_year = pd.to_datetime(gender.birth_year, format="%Y")

### Make sure the datatype of the columns 'birth_year' and 'birth_date' is datetime

### Վստահ եղեք, որ 'birth_year' և 'birth_date' սյուները datetime տիպի են

In [126]:
gender.dtypes

user_id                int64
age                    int64
gender                object
occupation          category
zip_code              object
birth_year    datetime64[ns]
birth_date    datetime64[ns]
dtype: object

### Change the values in the column user_id to have the values of type string of the same length (use the method of your choice). As an example, if we have values 0, 1 and 100, we could have values '000', '001' and '100' as a result.

### Փոխեք user_id սյան արժեքները նույն երկարություն ունեցող string տիպի արժեքներով՝ գործածելով Ձեր ցանկացած մեթոդը։ Որպես օրինակ, եթե ունեք 0, 1 և 100 աևժեքներ, Ձեր արդյունքը կարող է լինել '000', '001' և'100'

In [127]:
gender.user_id = gender.astype(str).user_id.str.zfill(4)

In [128]:
gender

    user_id  age  gender     occupation zip_code birth_year birth_date
0      0001   24    Male     technician    85711 1997-01-01 1997-05-02
1      0002   53  Female          other    94043 1968-01-01 1968-05-02
2      0003   23    Male         writer    32067 1998-01-01 1998-05-02
3      0004   24    Male     technician    43537 1997-01-01 1997-05-02
4      0005   33  Female          other    15213 1988-01-01 1988-05-02
..      ...  ...     ...            ...      ...        ...        ...
938    0939   26  Female        student    33319 1995-01-01 1995-05-02
939    0940   32    Male  administrator    02215 1989-01-01 1989-05-02
940    0941   20    Male        student    97229 2001-01-01 2001-05-02
941    0942   48  Female      librarian    78209 1973-01-01 1973-05-02
942    0943   22    Male        student    77841 1999-01-01 1999-05-02

[943 rows x 7 columns]